Revit 2024 API
Color Members
The Color type exposes the following members.
Constructors
Name | Description
Color
Constructor that takes the red, green and blue channels of the color.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Blue
Get the blue channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
Green
Get the green channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
InvalidColorValue
 Get the invalid Color whose IntegerValue is -1.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
IsValid
Identifies if the color represents a valid color, or an uninitialized/invalid value.
Red
Get the red channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
See Also
Color Class
Autodesk.Revit.DB Namespace